Repository: OkamiOps/odete-ide
Catalog: Packages/OdeteI18n/Sources/OdeteI18n/Resources/Localizable.xcstrings
Source language: pt_br
Languages: de, en, es, fr

source: usuário
de: Nutzer
en: username
es: usuario
fr: utilisateur

source: vite build: nenhum <script type=module src> no index.html
de: vite build: kein <script type=module src> in index.html
en: vite build: no <script type=module src> in index.html
es: vite build: ningún <script type=module src> en el index.html
fr: vite build: aucun <script type=module src> dans index.html

source: vite build: o index.html carrega %1$@, que não existe
de: vite build: index.html lädt %1$@, das es nicht gibt
en: vite build: index.html loads %1$@, which doesn't exist
es: vite build: el index.html carga %1$@, que no existe
fr: vite build : index.html charge %1$@, qui n’existe pas

source: vite build: sem index.html
de: vite build: kein index.html
en: vite build: no index.html
es: vite build: sin index.html
fr: vite build: pas d’index.html

source: vitest %1$@ não existe no executor embutido da Odete; use vitest run
de: vitest %1$@ gibt es in Odetes integriertem Runner nicht; verwende vitest run
en: vitest %1$@ isn't available in Odete's built-in runner; use vitest run
es: vitest %1$@ no existe en el ejecutor integrado de Odete; usa vitest run
fr: vitest %1$@ n'existe pas dans l'exécuteur intégré d'Odete ; utilise vitest run

source: vitest: o vitest de verdade não roda no iPad (precisa de worker_threads e do binário nativo do vite); usando o executor embutido da Odete
de: vitest: Das echte vitest läuft nicht auf dem iPad (es braucht worker_threads und die native Binärdatei von vite); Odetes integrierter Runner wird verwendet
en: vitest: the real vitest doesn't run on iPad (it needs worker_threads and vite's native binary); using Odete's built-in runner
es: vitest: el vitest real no funciona en el iPad (necesita worker_threads y el binario nativo de vite); usando el ejecutor integrado de Odete
fr: vitest : le vrai vitest ne fonctionne pas sur iPad (il a besoin de worker_threads et du binaire natif de vite) ; utilisation de l'exécuteur intégré d'Odete

source: você:
de: Sie:
en: you:
es: tú:
fr: vous :

source: voltou: %1$@
de: rückgängig gemacht: %1$@
en: undone: %1$@
es: deshecho: %1$@
fr: annulé : %1$@

source: xAI não devolveu access token
de: xAI hat kein access token zurückgegeben
en: xAI didn't return an access token
es: xAI no devolvió access token
fr: xAI n’a pas renvoyé d’access token

source: xAI não devolveu device_code, user_code e verification_uri
de: xAI hat device_code, user_code und verification_uri nicht zurückgegeben
en: xAI didn't return device_code, user_code and verification_uri
es: xAI no devolvió device_code, user_code y verification_uri
fr: xAI n’a pas renvoyé device_code, user_code et verification_uri

source: zip truncado
de: zip abgeschnitten
en: truncated zip
fr: zip tronqué

source: zip vazio
de: leeres zip
en: empty zip
es: zip vacío
fr: zip vide

source: | arquivo | o que é | | --- | --- | | `index.html` | página do preview | | `src/style.css` | visual | | `src/main.js` | comportamento |
de: | Datei | was es ist | | --- | --- | | `index.html` | Seite des Previews | | `src/style.css` | Optik | | `src/main.js` | Verhalten |
en: | file | what it is | | --- | --- | | `index.html` | preview page | | `src/style.css` | looks | | `src/main.js` | behavior |
es: | archivo | qué es | | --- | --- | | `index.html` | página del preview | | `src/style.css` | aspecto | | `src/main.js` | comportamiento |
fr: | fichier | ce que c’est | | --- | --- | | `index.html` | page du preview | | `src/style.css` | visuel | | `src/main.js` | comportement |

source: À direita
de: Rechts
en: On the right
es: A la derecha
fr: À droite

source: À esquerda
de: Links
en: On the left
es: A la izquierda
fr: À gauche

source: Índigo.
de: Indigo.
en: Indigo.
fr: Indigo.

source: Último turno
de: Letzte Runde
en: Last turn
fr: Dernier tour

source: árvore
de: Baum
en: tree
es: árbol
fr: arborescence

source: árvore do HEAD
de: Baum von HEAD
en: HEAD tree
es: árbol del HEAD
fr: arborescence du HEAD

source: índice
de: Index
en: index
fr: index

source: índice %1$@ fora do array
de: Index %1$@ außerhalb des Arrays
en: index %1$@ outside the array
es: índice %1$@ fuera del array
fr: index %1$@ hors de l’array

source: último commit desfeito, alterações no stage
de: letzter commit widerrufen, Änderungen im stage
en: last commit undone, changes staged
es: último commit deshecho, cambios en el stage
fr: dernier commit annulé, modifications au stage

source: ✓ build em %1$@/
de: ✓ Build in %1$@/
en: ✓ build in %1$@/
es: ✓ build en %1$@/
fr: ✓ build dans %1$@/

source: ✓ build em dist/
de: ✓ build in dist/
en: ✓ build in dist/
es: ✓ build en dist/
fr: ✓ build dans dist/

source: Fotos
en: Photos
fr: Photos

source: Desktop 16:9
es: Escritorio 16:9

source: Layout
es: Disposición
fr: Disposition

source: Sidebar
es: Barra lateral
fr: Barre latérale

source: Editor
fr: Éditeur

source: PRs
fr: PR
